%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @author Владимир Щербина <vns.scherbina@gmail.com>
%% @copyright 2017
%% @version 1.1.0
%% @doc Модуль <b>{@module}</b> реализует обработчик основной страницы HTTP-сервера.
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
-module(toppage_handler).

-export([init/3]).
-export([handle/2]).
-export([terminate/3]).

%%%%%%%%%%%%%%%%%%%%%%
%%% public функции %%%
%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @spec (_Transport, Req, []) -> term
%% @doc <i>Инициализация запроса</i>
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
init(_Transport, Req, []) ->
	{ok, Req, undefined}.

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @spec (Req, State) -> term
%% @doc <i>Обработка запроса</i>
%% <p>
%% <b>Req</b> - запрос по протоколу HTTP;<br/>
%% <b>State</b> - состояние обработчика запроса.
%% </p>
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
handle(Req, State) ->
	Html = get_html(),
	{ok, Req2} = cowboy_req:reply(200,
		[{<<"content-type">>, <<"text/html">>}],
		Html, Req),
	{ok, Req2, State}.


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @spec (_Reason, _Req, _State) -> ok
%% @doc <i>Завершение запроса</i>
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
terminate(_Reason, _Req, _State) ->
	ok.


%%%%%%%%%%%%%%%%%%%%%%%
%%% private функции %%%
%%%%%%%%%%%%%%%%%%%%%%%

get_html() ->
	<<"<html>
	<head>
	</head>
	<body>
		<h1>МК \"Завод\", Доменная печь.</h1>
		<hr/>
		<h1>АСУТП ДП:</h1>
		<hr/>
		<p>
			<h3><a href=\"/rest/reports\">Протоколы и рапорта ...</a></h3>
		</p>
		<p>
			<h3><a href=\"/rest/tags\">Теги ...</a></h3>
		</p>
		<p>
			<h3><a href=\"/hmi32?screen=0\">Открыть модуль визуализации (32bit)...</a></h3>
		</p>
		<p>
			<h3><a href=\"/hmi?screen=0\">Открыть модуль визуализации (64bit)...</a></h3>
		</p>
		<p>
			<h3><a href=\"/jre.exe\">Загрузить среду исполнения Java (32bit) ...</a></h3>
		</p>
		<p>
			<h3><a href=\"/jre64.exe\">Загрузить среду исполнения Java (64bit) ...</a></h3>
		</p>
	</body>
</html>">>.