%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @author Владимир Щербина <vns.scherbina@gmail.com>
%% @copyright 2017
%% @version 1.0.0
%% @doc Модуль <b>journal6.erl</b> реализует формирование данных
%% для документа печного журнала <Химический состав сырья>.
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
-include("reports.hrl").

%%%%%%%%%%%%%%%%%%%%%%
%%% public функции %%%
%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @spec ({struct,Props}) -> term
%% @doc <i>Формирование данных для рапорта</i>
%% <p>
%% <b>Props</b> - список ключей со значениями.
%% </p>
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
data({struct,Props}) ->
	{{Year,Month,Day},{_Hour,_Minute,_Second}}=get_timestamp("report_date",Props),
	_ShiftStart1=get_shift_start(Year,Month,Day,1),
	_ShiftStart2=get_shift_start(Year,Month,Day,2),
	_ShiftStart3=get_shift_start(Year,Month,Day,3),
	ReportDateStr=format_date({{Year,Month,Day},{0,0,0}}),
	Shift1Rows=[
		[
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78,
			7.89,
			8.91
		],
		[
			"23:45",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78,
			7.89,
			8.91
		],
		[
			"01:23",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78,
			7.89,
			8.91
		],
		[
			"21:43",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78,
			7.89,
			8.91
		],
		[
			"10:32",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78,
			7.89,
			8.91
		]
	],
	Shift2Rows=Shift1Rows,
	Shift3Rows=Shift1Rows,
	CokeRows=[
		[
			"XXXXXXXXXX",
			1,
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78
		],
		[
			"XXXXXXXXXX",
			1,
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78
		],
		[
			"XXXXXXXXXX",
			1,
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78
		],
		[
			"XXXXXXXXXX",
			1,
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78
		],
		[
			"XXXXXXXXXX",
			1,
			"12:34",
			1.23,
			2.34,
			3.45,
			4.56,
			5.67,
			6.78
		]
	],
	Ash1=1,
	Ash2=2,
	Ash3=3.45,
	Ash4=6.7,
	{ok,
		[
			{"name","Печной журнал. Химический состав сырья."},
			{"report_date",ReportDateStr},
			{"shift1_rows",Shift1Rows},
			{"shift2_rows",Shift2Rows},
			{"shift3_rows",Shift3Rows},
			{"coke_rows",CokeRows},
			{"ash1",Ash1},
			{"ash2",Ash2},
			{"ash3",Ash3},
			{"ash4",Ash4}
		]
	};
data(_) ->
	{ok,[]}.