%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @author Владимир Щербина <vns.scherbina@gmail.com>
%% @copyright 2017
%% @version 1.0.0
%% @doc Модуль <b>journal5.erl</b> реализует формирование данных
%% для документа печного журнала <Состав шихты>.
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
-include("reports.hrl").

%%%%%%%%%%%%%%%%%%%%%%
%%% public функции %%%
%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% @spec ({struct,Props}) -> term
%% @doc <i>Формирование данных для рапорта</i>
%% <p>
%% <b>Props</b> - список ключей со значениями.
%% </p>
%% @end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
data({struct,Props}) ->
	{{Year,Month,Day},{_Hour,_Minute,_Second}}=get_timestamp("report_date",Props),
	ReportDateStr=format_date({{Year,Month,Day},{0,0,0}}),
	DataRows=[
		[
			"XX.XX.XXXX XX:XX:XX",
			1,
			1.2345,
			12.345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345
		],
		[
			"XX.XX.XXXX XX:XX:XX",
			2,
			1.2345,
			12.345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345
		],
		[
			"XX.XX.XXXX XX:XX:XX",
			3,
			1.2345,
			12.345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345,
			1.2345
		]
	],
	{ok,
		[
			{"name","Печной журнал. Состав шихты."},
			{"report_date",ReportDateStr},
			{"data_rows",DataRows}
		]
	};
data(_) ->
	{ok,[]}.